BojanJurca/Esp32_oscilloscope/servers/oscilloscope.h
            passSamplesToOscSender:

                // pass readBuffer to oscSender
                readBuffer->sampleCount = noOfSamplesTaken + 1; // + 1 dummy sample
                if (!sendBuffer->samplesAreReady) 
                    *sendBuffer = *readBuffer;

                // uninstall the driver
                i2s_driver_uninstall (I2S_NUM_0);

                // wait before next screen refresh
                vTaskDelayUntil (&lastScreenRefreshTicks, pdMS_TO_TICKS (screenRefreshMilliseconds));
            
            } // while sampling

            // wait for the STOP signal
            while (((oscSharedMemory *) sharedMemory)->oscReaderState != STOP) delay (1);
            ((oscSharedMemory *) sharedMemory)->oscReaderState = STOPPED; 

            vTaskDelete (NULL);
        }
    #endif


    // oscSender oscSender oscSender oscSender oscSender oscSender oscSender oscSender oscSender oscSender oscSender oscSender oscSender oscSender oscSender 
    
    void oscSender (void *sharedMemory) {
      unsigned char gpio1 =                   (unsigned char) ((oscSharedMemory *) sharedMemory)->gpio1; // easier to check validity with unsigned char then with integer 
      unsigned char gpio2 =                   (unsigned char) ((oscSharedMemory *) sharedMemory)->gpio2; // easier to check validity with unsigned char then with integer
      unsigned char noOfSignals = 1; if (gpio2 <= 39) noOfSignals = 2;  // monitor 1 or 2 signals
      oscSamples *sendBuffer =                &((oscSharedMemory *) sharedMemory)->sendBuffer;
      sendBuffer->samplesAreReady = false;     
      bool clientIsBigEndian =                ((oscSharedMemory *) sharedMemory)->clientIsBigEndian;
      WebSocket *webSocket =                  ((oscSharedMemory *) sharedMemory)->webSocket; 
    
      unsigned long lastMillis = millis ();
      while (true) { 
        delay (1);
        // send samples to javascript client if they are ready
        if (sendBuffer->samplesAreReady && sendBuffer->sampleCount) {
          // copy buffer with samples within critical section
          oscSamples sendSamples = *sendBuffer;
          sendBuffer->samplesAreReady = false; // oscRader will set this flag when buffer is the next time ready for sending
          // swap bytes if javascript client is big endian
          int sendBytes; // calculate the number of bytes in the buffer

          // find out the type of buffer used
          if (noOfSignals == 1) 
              if (sendSamples.samplesI2sSignal [0].signal1 < -3) 
                  sendBytes = sendSamples.sampleCount * sizeof (oscI2sSample);  // 1 I2S signal (I2S signal does not starts with -1, -2 or -3 dummy value)
              else
                  sendBytes = sendSamples.sampleCount * sizeof (osc1SignalSample); // 1 signal with deltaTime
          else                  
              sendBytes = sendSamples.sampleCount * sizeof (osc2SignalsSample); // 2 signals with deltaTime
          int sendWords = sendBytes >> 1;                                 // number of 16 bit words = number of bytes / 2

          if (clientIsBigEndian) {
            uint16_t *w = (uint16_t *) &sendSamples;
            for (size_t i = 0; i < sendWords; i ++) w [i] = htons (w [i]);
          }
          if (!webSocket->sendBinary ((byte *) &sendSamples,  sendBytes)) return;
        }
    
        // read (text) stop command form javscrip client if it arrives - according to oscilloscope protocol the string could only be 'stop' - so there is no need checking it
        if (webSocket->available () != WebSocket::NOT_AVAILABLE) return; // this also covers ERROR and TIME_OUT
        if (webSocket->getSocket () == -1) return; // if the socket has been closed by oscReader
      }
    }

    // main oscilloscope function - it reads request from javascript client then starts two threads: oscilloscope reader (that reads samples ans packs them into buffer) and oscilloscope sender (that sends buffer to javascript client)

    void runOscilloscope (WebSocket *webSocket) {
    
      // set up oscilloscope shared memory that will be shared among all 3 oscilloscope threads
      oscSharedMemory sharedMemory = {};                           // get some memory that will be shared among all oscilloscope threads and initialize it with zerros
      sharedMemory.webSocket = webSocket;                          // put webSocket rference into shared memory
      sharedMemory.readBuffer.samplesAreReady = true;              // this value will be copied into sendBuffer later where this flag will be checked
    
      // oscilloscope protocol starts with binary endian identification from the client
      uint16_t endianIdentification = 0;
      if (webSocket->readBinary ((byte *) &endianIdentification, sizeof (endianIdentification)) == sizeof (endianIdentification))
        sharedMemory.clientIsBigEndian = (endianIdentification == 0xBBAA); // cient has sent 0xAABB
      if (!(endianIdentification == 0xAABB || endianIdentification == 0xBBAA)) {
        #ifdef __DMESG__
            dmesgQueue << "[oscilloscope] communication does not follow oscilloscope protocol. Expected endian identification.";
        #endif
        webSocket->sendString ("[oscilloscope] communication does not follow oscilloscope protocol. Expected endian identification."); // send error also to javascript client
        return;
      }
    
      // oscilloscope protocol continues with (text) start command in the following forms:
      // start digital sampling on GPIO 36 every 250 ms screen width = 10000 ms
      // start analog sampling on GPIO 22, 23 every 100 ms screen width = 400 ms set positive slope trigger to 512 set negative slope trigger to 0
      string s = webSocket->readString (); 
      __oscilloscope_h_debug__ ("runOscilloscope: command =  " + String ((char *) s));

      if (s == "") {
        #ifdef __DMESG__
          dmesgQueue << "[oscilloscope] communication does not follow oscilloscope protocol. Expected start oscilloscope parameters.";
        #endif
        webSocket->sendString ("[oscilloscope] communication does not follow oscilloscope protocol. Expected start oscilloscope parameters."); // send error also to javascript client
        return;
      }
      
      // try to parse what we have got from client
      char posNeg1 [9] = "";
      char posNeg2 [9] = "";
      int treshold1;
      int treshold2;
      char *cmdPart1 = (char *) s;
      char *cmdPart2 = strstr (cmdPart1, " every"); 
      char *cmdPart3 = NULL;
      if (cmdPart2) {
        *(cmdPart2++) = 0;
        cmdPart3 = strstr (cmdPart2, " set"); 
        if (cmdPart3) 
          *(cmdPart3++) = 0;
      }
      // parse 1st part
      sharedMemory.gpio1 = sharedMemory.gpio2 = 255; // invalid GPIO
      if (sscanf (cmdPart1, "start %7s sampling on GPIO %2i, %2i", sharedMemory.readType, &sharedMemory.gpio1, &sharedMemory.gpio2) < 2) {
        #ifdef __DMESG__
            dmesgQueue << "[oscilloscope] oscilloscope protocol syntax error.";
        #endif
        webSocket->sendString ("[oscilloscope] oscilloscope protocol syntax error."); // send error also to javascript client
        return;
      }
      // use adc1_get_raw instead of analogRead
      if (!strcmp (sharedMemory.readType, "analog")) {

          #if CONFIG_IDF_TARGET_ESP32
              __oscilloscope_h_debug__ ("MCU ESP32 pinout");

              // ESP32 board: https://docs.espressif.com/projects/esp-idf/en/v4.2/esp32/api-reference/peripherals/adc.html
              switch (sharedMemory.gpio1) {
                  // ADC1
                  case 36: sharedMemory.adcchannel1 = ADC1_CHANNEL_0; break;
                  case 37: sharedMemory.adcchannel1 = ADC1_CHANNEL_1; break;
                  case 38: sharedMemory.adcchannel1 = ADC1_CHANNEL_2; break;
                  case 39: sharedMemory.adcchannel1 = ADC1_CHANNEL_3; break;
                  case 32: sharedMemory.adcchannel1 = ADC1_CHANNEL_4; break;
                  case 33: sharedMemory.adcchannel1 = ADC1_CHANNEL_5; break;
                  case 34: sharedMemory.adcchannel1 = ADC1_CHANNEL_6; break;
                  case 35: sharedMemory.adcchannel1 = ADC1_CHANNEL_7; break;
                  // ADC2 (GPIOs 4, 0, 2, 15, 13, 12, 14, 27, 25, 26), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSocket->sendString (string ("[oscilloscope] can't analogRead GPIO ") + string (sharedMemory.gpio1) + "."); // send error also to javascript client
                            return;  
              }
              switch (sharedMemory.gpio2) {
                  // ADC1
                  case 36: sharedMemory.adcchannel2 = ADC1_CHANNEL_0; break;
                  case 37: sharedMemory.adcchannel2 = ADC1_CHANNEL_1; break;
                  case 38: sharedMemory.adcchannel2 = ADC1_CHANNEL_2; break;
                  case 39: sharedMemory.adcchannel2 = ADC1_CHANNEL_3; break;
                  case 32: sharedMemory.adcchannel2 = ADC1_CHANNEL_4; break;
                  case 33: sharedMemory.adcchannel2 = ADC1_CHANNEL_5; break;
                  case 34: sharedMemory.adcchannel2 = ADC1_CHANNEL_6; break;
                  case 35: sharedMemory.adcchannel2 = ADC1_CHANNEL_7; break;
                  // not used
                  case 255: break;
                  // ADC2 (GPIOs 4, 0, 2, 15, 13, 12, 14, 27, 25, 26), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSocket->sendString (string ("[oscilloscope] can't analogRead GPIO ") + string (sharedMemory.gpio2) + "."); // send error also to javascript client
                            return;  
              }


          // GPIO to CHANNEL mapping depending on the board type: https://github.com/espressif/arduino-esp32/blob/master/boards.txt
          #elif CONFIG_IDF_TARGET_ESP32S2
              __oscilloscope_h_debug__ ("MCU ESP32S2 pinout");

              // ESP32 S2 board: https://docs.espressif.com/projects/esp-idf/en/v4.4.1/esp32s2/api-reference/peripherals/adc.html
              switch (sharedMemory.gpio1) {
                  // ADC1
                  case  1: sharedMemory.adcchannel1 = ADC1_CHANNEL_0; break;
                  case  2: sharedMemory.adcchannel1 = ADC1_CHANNEL_1; break;
                  case  3: sharedMemory.adcchannel1 = ADC1_CHANNEL_2; break;
                  case  4: sharedMemory.adcchannel1 = ADC1_CHANNEL_3; break;
                  case  5: sharedMemory.adcchannel1 = ADC1_CHANNEL_4; break;
                  case  6: sharedMemory.adcchannel1 = ADC1_CHANNEL_5; break;
                  case  7: sharedMemory.adcchannel1 = ADC1_CHANNEL_6; break;
                  case  8: sharedMemory.adcchannel1 = ADC1_CHANNEL_7; break;
                  case  9: sharedMemory.adcchannel1 = ADC1_CHANNEL_8; break;
                  case 10: sharedMemory.adcchannel1 = ADC1_CHANNEL_9; break;
                  // ADC2 (GPIOs 11, 12, 13, 14, 15, 16, 17, 18, 19, 20), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSocket->sendString (string ("[oscilloscope] can't analogRead GPIO ") + string (sharedMemory.gpio1) + "."); // send error also to javascript client
                            return;  
              }
              switch (sharedMemory.gpio2) {
                  // ADC1
                  case  1: sharedMemory.adcchannel2 = ADC1_CHANNEL_0; break;
                  case  2: sharedMemory.adcchannel2 = ADC1_CHANNEL_1; break;
                  case  3: sharedMemory.adcchannel2 = ADC1_CHANNEL_2; break;
                  case  4: sharedMemory.adcchannel2 = ADC1_CHANNEL_3; break;
                  case  5: sharedMemory.adcchannel2 = ADC1_CHANNEL_4; break;
                  case  6: sharedMemory.adcchannel2 = ADC1_CHANNEL_5; break;
                  case  7: sharedMemory.adcchannel2 = ADC1_CHANNEL_6; break;
                  case  8: sharedMemory.adcchannel2 = ADC1_CHANNEL_7; break;
                  case  9: sharedMemory.adcchannel2 = ADC1_CHANNEL_8; break;
                  case 10: sharedMemory.adcchannel2 = ADC1_CHANNEL_9; break;
                  // not used
                  case 255: break;
                  // ADC2 (GPIOs 11, 12, 13, 14, 15, 16, 17, 18, 19, 20), the reading blocks when used together with WiFi?
                  // other GPIOs do not have ADC
                  default:  webSocket->sendString (string ("[oscilloscope] can't analogRead GPIO ") + string (sharedMemory.gpio2) + "."); // send error also to javascript client
                            return;  
              }

          // #elif CONFIG_IDF_TARGET_ESP32C2

          #elif CONFIG_IDF_TARGET_ESP32S3
              __oscilloscope_h_debug__ ("MCU ESP32S3 pinout");

